{
    "qas": [
        {
            "href": "http://www.zaeke.com/article-3312-1.html",
            "data": {
                "0": {
                    "Q": "Q：小米5的做工表现如何？",
                    "A": "A：正如文章内容中所说的，小米5是目前最为精致漂亮的小米手机。但其机身背面的3D玻璃是通过卡扣与机身结合的，这使得其不得不预留一定的安装精度，使得其算不上紧密结合。并且还可能出现卡扣紧密程度不同导致的缝隙出现。"
                },
                "1": {
                    "Q": "Q：小米5耐摔么？",
                    "A": "A：很遗憾的是，还真的对这一点有所了解。小米5在高越80cm的距离掉落后，屏幕依然完好无损，金属边框则是出现一定的凹陷痕迹。但其漂亮的3D玻璃后盖则是破裂，而官方更换价格为180元人民币，安装手工费为30元。此外在正常使用中，小米5的屏幕与背面均有一定的磨损痕迹，需要侧光才能够清晰看到，并不会影响正常使用。"
                },
                "2": {
                    "Q": "Q：小米5所谓的全网通 3.0的“黑科技”表现在哪里？",
                    "A": "A：得益于采用高通骁龙820处理器，小米3能够支持使用体验更为优秀的全网通3.0。与全网通2.0相同的是，其依然移动、联通、电信的2/3/4G网络，并且实现主卡盲插，但依然不能同时使用两张电信卡。值得注意的是，全网通3.0的特别之处在于副卡能够支持联通3G网络待机，这使得副卡的通话质量更高。"
                },
                "3": {
                    "Q": "Q：小米5是否与小米Note同样搭载Hi-Fi芯片？其音质如何？",
                    "A": "A：小米5并没有搭载任何的Hi-Fi芯片，在硬素质上自然没有多少优势。而在实际听感上，大概是目前智能手机的普遍水准，并没有太多值得描述的地方。"
                }
            }
        },
        {
            "href": "http://www.zaeke.com/article-3497-1.html",
            "data": {
                "0": {
                    "Q": "Q：我应该选择哪一个版本好？",
                    "A": "A：华为P9共计有三种版本，分别是运营商定制版、标配版与高配版，售价分别为2988、3188、3688，特点分别是价格最低、各方面平衡以及最为豪华。最为推荐的自然是高配版本，虽说售价最高，但不仅有着全网通的特性、更强的硬件配置，还有着文章中提及的独特工艺加持，而这一点反而更为关键。"
                },
                "1": {
                    "Q": "Q：华为P9有什么缺点？",
                    "A": "A：就目前的感受来说，华为P9的屏幕触控反应以及日常使用发热还需要好好调整，如此前的Mate 8相同，需要经过多个系统版本更新后才能够称得上完美。此外华为P9的屏幕色彩以及充电速度只能算是中规中矩，并且明明支持快速充电却标配5V/2A充电器，这更让人觉得不够上心。"
                },
                "2": {
                    "Q": "Q：华为P9的指纹识别支持微信支付么？",
                    "A": "A：目前并不支持微信支付，仅支持支付宝支付。"
                },
                "3": {
                    "Q": "Q：华为P9的做工表现如何？",
                    "A": "A：在我们手上使用的两台高配版华为P9，整体做工表现是相当优秀，大概相较Mate S稍显逊色些。主要问题在于后置摄像头部分的玻璃材质与机身结合的中规中矩，其中一台出现明显的高低差，而另外一台则相对优秀的多。"
                },
                "4": {
                    "Q": "Q：徕卡（LEICA）在华为P9上的作用？",
                    "A": "A：目前能够说的清的，分别是位于后置摄像头的标志、宣称徕卡参与设计与品质监控的后置摄像头镜头、拍摄功能中的徕卡水印、色彩模式以及快门声。说不清亦或者不能量化的，是其在拍摄成像的参与调校。"
                }
            }
        },
        {
            "href": "http://www.zaeke.com/article-3820-1.html",
            "data": {
                "0": {
                    "Q": "Q：魅族PRO 6有NFC功能么？能和PRO 5一样做深圳通公交卡么？",
                    "A": "A：这一次并不支持NFC功能。"
                },
                "1": {
                    "Q": "Q：魅族PRO 6的指纹能做到什么功能？",
                    "A": "A：能够支持支付宝支付以及魅族自家的mPay，也就是针对自家的应用，暂不支持微信支付。至于文档加密、应用加密等就没啥特别好说的了。"
                },
                "2": {
                    "Q": "Q：魅族PRO 6的做工表现如何？容易掉漆么？",
                    "A": "A：这里顺便一提，相比起魅族PRO 5的包装很好的卡紧机器，这一回的魅族PRO 6实在是不行。开箱时就不幸从70cm高处摔落，倒是砸了个坑而已，没有出现刮擦导致的掉漆。在使用一个月的时间，也仅SIM卡卡槽出现零星且微小的掉漆。"
                },
                "3": {
                    "Q": "Q：魅族PRO 6的发热情况如何？充电时候的发热如何？",
                    "A": "A：发热情况中规中矩，静如处子动如脱兔。充电时的发热导致控制的还好，只是依然不适合充电时同时使用。"
                },
                "4": {
                    "Q": "Q：哪个颜色最好看？",
                    "A": "A：这是个相当见仁见智的问题，我推荐黑色。即便说魅族后续推出了烈焰红与玫瑰金，但这一回的星空黑实际效果或者说长期看下去更为适合的多。"
                }
            }
        },
        {
            "href": "http://www.zaeke.com/article-4290-1.html",
            "data": {
                "0": {
                    "Q": "Q：小米6这么多个版本，应该买哪个？",
                    "A": "A：小米6这回就三个硬件配置，均标配满血的骁龙835和6G内存，剩下的就是储存空间和材质。其中起步价2499元是最实在的选择，要是对储存空间有要求就直接上陶瓷版，与高配版同样配置，就贵了100块钱有更好的质感。"
                },
                "1": {
                    "Q": "Q：做工表现如何？看到有人吐槽缝隙大。",
                    "A": "A：手上就一台工程机，和同样结构的小米5做比较，后盖和机身的结合好的太大。至于缝隙，由于机身中框和后盖材质不同，有缝隙是必然的事情。除四个圆角的缝隙较为明显，能塞个名片卡着，其他挺OK的。"
                },
                "2": {
                    "Q": "Q：用起来耐磨么？需要戴套用么？",
                    "A": "A：毕竟玻璃材质嘛，比起金属在耐磨这事情差挺大的，用了一个月大的痕迹没多少，小痕迹侧着看能看出来。至于戴不戴套，那就是见仁见智的事情，反正这回标配有，我自己买了个官方的用了一段时间可不错。今天早上起床还裸机摔了下，没啥大问题。"
                },
                "3": {
                    "Q": "Q：网传小米6有充电自动重启、Wi-Fi断流等问题，实际上有么？",
                    "A": "A：在我一个月的实际使用中，并没有感受到这两个问题，或许是个体样本不同吧。另外在早期的系统版本中，小米6存在莫名其妙的卡顿以及突然的黑白屏死机，在经过多次的系统版本更新好，这些问题已经的得以解决，没有再出现过。"
                },
                "4": {
                    "Q": "Q：和iPhone 7 Plus相比，小米6的拍照怎么样？",
                    "A": "A：以双摄来说，两者是完全一样的设计方案，甚至连像素大小、光学防抖设计等都是相当的。至于用起来的体验吧，相比起iPhone有这样那样的限制，小米6要灵活的多，功能也相对全面。以画质做比较，小米6就稍显逊色些。"
                }
            }
        },
        {
            "href": "http://www.zaeke.com/article-7080-1.html",
            "data": {
                "0": {
                    "Q": "Q：三星Galaxy S8与S8+应该如何选择？",
                    "A": "A：虽然由于全视曲面屏的应用，使得机身尺寸比起同尺寸屏幕的机型要小得多。但即便如此，S8+的机身尺寸还是比较明显。并且18.5：9的比例，又使得其较为修长，让背面指纹用起来更加别扭。所以我就选择S8，并且手感也更为舒服点。"
                },
                "1": {
                    "Q": "Q：那4G和6G内存又是如何选择？",
                    "A": "A：目前仅Galaxy S8+提供6G内存的皇帝版，S8是木有的，并且在可预见的未来也不大可能会追加。所以如果你的配置参数爱好者，自然是选择皇帝版咯。当然以三星国行的系统优化来说，有更大的内存也有更多的空间。"
                },
                "2": {
                    "Q": "Q：在收购哈曼集团之后，三星Galaxy S8标配的AKG耳机之外，还有没在音质上有用？这个AKG耳机的表现又如何？",
                    "A": "A：虽说确实是收购了，可两者之间的合作还没这么快发生，并且更多是侧重于汽车领域的。得益于骁龙835移动平台，三星Galaxy S8的音质表现在理论上要比之前更好。至于这个耳机嘛，比起别家普通标配的多少要好些的。"
                },
                "3": {
                    "Q": "Q：除了充电功率较低之外，三星这回的续航表现如何？",
                    "A": "A：由于前辈的事情，三星在电池这一块非常的谨慎。在文中已经有介绍关于充电功率限制的事情，电池更是麻烦。三星Galaxy S8的电池仅有3000mAh，这个数字在目前只属于合格的水准。加上三星中国在系统优化的尴尬，实际表现还是带上移动电源更为保险带来。当然，你也可以选择更大的S8+"
                },
                "4": {
                    "Q": "Q：那么安全问题。。。。",
                    "A": "A：面对这样的尴尬问题，三星自然是要打起十二分精神，毕竟再来一次谁都受不了。话说正是因为前辈的问题，使得三星Galaxy S8是跳票了几个月，着重电池设计问题。目前三星更是将整个检测标准提高，并且在电池方面做软硬件的严格管控（就是充电功率低和电池容量变小）。至于会不会发生问题，以目前全球市场的数百万台乃至上千万台销量来看，可以给打个“安全”。"
                }
            }
        },
        {
            "href": "http://www.zaeke.com/article-7419-1.html",
            "data": {
                "0": {
                    "Q": "Q：看到不少人都说一加手机5的屏幕和之前的一样，会辣眼睛?",
                    "A": "A：首先要明确的是，一加手机5所采用的屏幕与前代相同，都是1920*1080的AMOLED屏幕，但并不是采用同样款式/批次的产品。虽在视觉的精细程度比起2K分辨率要逊色，可在阴阳屏、发红等问题上有这很大的改善。至于具体的，就只能根据每个人的实际感受去选择。"
                },
                "1": {
                    "Q": "Q：一加手机5有两种配置，8G貌似我用不上啊。",
                    "A": "A：一加手机5分别有6+64和8+128两种配置，价格分别是2999和3499。账面上看前者便宜点，但其实同价位同配置有不少的选择。可后者的8G是目前仅有的选择，并且是相当容易就能够买到，以我对内存多多益善的想法，选择后者可以用的更长久些，其实也更具性价比的"
                },
                "2": {
                    "Q": "Q：为什么没写续航？",
                    "A": "A：相比起前代，一加手机5的电池大点到3300mAh，还是用5V/4A的Dash闪充。原本前代就表现不错，这回在骁龙835的加持下，效果更为显著。当然都是一天没啥压力的主，在现在没啥好吹嘘的，所以就没写进去了啦。充电的温度啊、快速啊，也都是前代就有的，所以同样没写进去咯。"
                },
                "3": {
                    "Q": "Q：会不会有一加手机5T这样的产品？",
                    "A": "A：要是高通和前代那样，先推出骁龙820再推骁龙821，那么一加十之八九也会有。"
                },
                "4": {
                    "Q": "Q：我看最初有反馈Wi-Fi断流或信号问题的，你有没遇到。",
                    "A": "A：作为最早拿到机器的一批人，要说没遇到是假的。早期系统版本出现过，明明链接了路由器却刷不出微博的，当然最新版本已经解决了。至于信号问题嘛，相比起手里别的旗舰机型，有小概率出现对面听不到声音的。找了售后上门检测，后续我继续更新反馈。"
                }
            }
        },
        {
            "href": "http://www.zaeke.com/article-7543-1.html",
            "data": {
                "0": {
                    "Q": "Q：HTC U11是没有BoomSound了么？",
                    "A": "A：虽说并没有正面明显的开孔，但HTC U11依然支持标志性的BoomSound，除了底部的扬声器外，还将听筒整合以实现双扬声器。实际效果比起普通机型是要好不少的。"
                },
                "1": {
                    "Q": "Q：这背面看起来挺漂亮的，耐刮么？",
                    "A": "A：这个看起来就漂亮的亮面，貌似耐划伤还ok，直接用衣服擦拭没有出现细微痕迹，比起之前貌似好些。不过这玩意不敢打包票，在半个多月的使用中，我们是全程配备保护套使用的。"
                },
                "2": {
                    "Q": "Q：这续航和充电咋又没说？",
                    "A": "A：因为HTC U11的电池为3000mAh，支持18W的QC 3.0快速充电技术，用的骁龙835处理器，没啥特别突出的也没啥特别好说的。实际表现也于同样参数的机型差不多，日常使用起来没啥好讲究的。所以文中没有给出具体的数字。<br><br>但要注意的是，由于系统没有针对国内特殊的全家桶做准备，所以如果是安装这类型应用的，多少有点悲伤。"
                },
                "3": {
                    "Q": "Q：音质表现如何，那送的转接线和耳机真的好么？",
                    "A": "A：以本机的音质表现来说，在常规设计中属于佼佼者，毕竟有着完整音频子系统的骁龙835，不过比起堆料的机型就要逊色也是意料之中的。至于耳机嘛，主要是功能性方面补充，文中也有介绍。<br><br>转接线要着重的介绍下，真的是HTC近年来做的好又卖得好口碑更好的产品，带来的提升是ok的，单独卖官方价达到199元，作为标配说得上良心。具体可参考<a href='http://www.zaeke.com/article-7349-1.html' target='_blank'>http://www.zaeke.com/article-7349-1.html</a>"
                },
                "4": {
                    "Q": "Q：我看有人吐槽HTC U11的触屏不大行啊，具体情况是啥？",
                    "A": "A：关于这点HTC目前并没有给出明确的消息，但网络上确实出现数起触屏问题，导致使用体验不佳。我们针对这点做了专门的测试，手中的测试样品并没有这样的情况。但并不意味市售版本都是完美的，建议购买时实际测试为准。"
                }
            }
        },
        {
            "href": "http://www.zaeke.com/article-8060-1.html",
            "data": {
                "0": {
                    "Q": "Q：小米MIX 2这块屏幕如何，我看官网图片不错？",
                    "A": "A：在实际数字方面，相比起小米MIX而言，小米MIX 2的屏占比是要更低。此外屏幕边框更明显，由于换用听筒设计，额头宽度也稍微大了些，并且金属机身呈现明显的凸起。这些加在一起，在屏幕尺寸变小的情况，视觉效果并没有脑补的那么“大”，反而会有边框怎么这么大的感觉。<br><br>要强烈的吐槽、建议和批评，小米官方放出的宣传资料以及官网对于小米MIX 2的屏占比过度修饰，很大程度会造成任何一个人对实物的高度幻想，进而因落差导致厌恶的。"
                },
                "1": {
                    "Q": "Q：你这次的续航和发热又没说啊。",
                    "A": "A：因为小米MIX 2的表现真没啥特别的，虽然说电池容量比前代有些小吧，不过3400mAh属于当前标准，或者比正常还要高那么点点。在骁龙835这个好处理器的加持下，随便用用一整天没啥问题。至于发热嘛，那就是大型游戏时会热，日常没啥感觉，也是很正常的表现。"
                },
                "2": {
                    "Q": "Q：这手机耐摔么？",
                    "A": "A：虽然说出厂前会有一定的测试标准，不过嘛任何产品都是不防手贱的。在我使用的这段时间来，带着手机壳从1m左右高度掉过几个，并不会有啥问题。但这个只是参考，并不带有普遍参考意义。<br><br>以产品本身来说，换用金属机身+陶瓷后盖这样的组合，小米MIX 2比起前辈要能抗点。话说更应该注意的是这块屏幕玻璃，挺容易出现划痕的。"
                },
                "3": {
                    "Q": "Q：我就觉得小米MIX 2没之前能装逼。",
                    "A": "A：我也是这么觉得的，应该金属机身+陶瓷后盖的机身设计，看起来没啥特别，就是比更光滑些和更有质感，加上保护壳什么都看不到热。不过嘛，你可以买全陶瓷尊享版，有Unibody全陶瓷机身，记得买白色的，更加扎眼。"
                }
            }
        }
    ]
}