;
(function($) {
    var $qa = $('[data-type="qa"]').first()
    var $list = $qa.find('[data-type="qalist"]').first()

    var data = null
    var length = 0

    function getDateLength(data) {
        var items = []
        for (var value in data) {
            if (data.hasOwnProperty(value)) {
                items.push(data)
            }
        }
        return items.length
    }

    if (window.location.href === 'http://www.zaeke.com/article-3312-1.html') {
        data = {
            0: {
                0: 'Q：Galaxy S7 edge大猩猩玻璃4的耐划程度如何？摔机时候容易碎么？',
                1: 'A：在使用两周多的时间里，其所采用的双面玻璃有一定的使用痕迹。曾经试过在0.5m高度摔落，并没有破碎情况，当然这个事情具体要看RP的。'
            },
            1: {
                0: 'Q：Galaxy S7 edge的边缘发青状况严重么？',
                1: 'A：正如文章中所提及的，其采用的双曲面屏幕的两侧曲面在曲率上是与平面不同，这就使得其在折射与观感上是不同的。具体表现在亮度更强以及色彩改变，所以与上一代产品依然有着边缘色彩奇怪的情况。'
            },
            2: {
                0: 'Q：屏幕显示模式中的不同是？',
                1: 'A：Galaxy S7 edge中提供四种显示模式，分别为自适应模式、基本、AMOLED影片以及AMOLED照片。其中自适应模式会根据显示图片进行分析来调整白平衡，而基本模式则是支持sRGB色彩方案，AMOLED照片则是AdobeRGB色彩方案。可以这么简单的理解，不同模式通过色彩与白平衡来进行区分，日常使用中比较推荐AMOLED照片模式，在色彩表现上更为准确。'
            },
            3: {
                0: 'Q：有没有所谓的全网通2.0或是3.0？',
                1: 'A：在实际测试中，Galaxy S7 edge的双卡双待能够不区分主卡副卡，随意插入电信卡，并可在系统内直接切换移动网络。插入两张卡后，待机分别处于4G与2G，并且不支持同时使用两张电信卡。'
            },
            4: {
                0: 'Q：曲面屏的误触严重么？',
                1: 'A：正如文章中所提及的，曲面屏的物理特性使得两侧曲面与手指是有直接接触的，并且目前的应用几乎将各类按键按钮都设定在两侧，特别是在输入法部分更是明显。这些硬件与软件的特性，都使得曲面屏必然存在误触的情况。但一方面长期使用后的适应能够明显的避免情况，另一方面曲面屏的缺点是必然的，既然啊想要炫酷自然得承担一定的风险。'
            }
        }
    } else if (window.location.href === 'http://www.zaeke.com/article-3379-1.html') {
        data = {
            0: {
                0: 'Q：小米5的做工表现如何？',
                1: 'A：正如文章内容中所说的，小米5是目前最为精致漂亮的小米手机。但其机身背面的3D玻璃是通过卡扣与机身结合的，这使得其不得不预留一定的安装精度，使得其算不上紧密结合。并且还可能出现卡扣紧密程度不同导致的缝隙出现。'
            },
            1: {
                0: 'Q：小米5耐摔么？',
                1: 'A：很遗憾的是，还真的对这一点有所了解。小米5在高越80cm的距离掉落后，屏幕依然完好无损，金属边框则是出现一定的凹陷痕迹。但其漂亮的3D玻璃后盖则是破裂，而官方更换价格为180元人民币，安装手工费为30元。此外在正常使用中，小米5的屏幕与背面均有一定的磨损痕迹，需要侧光才能够清晰看到，并不会影响正常使用。'
            },
            2: {
                0: 'Q：小米5所谓的全网通 3.0的“黑科技”表现在哪里？',
                1: 'A：得益于采用高通骁龙820处理器，小米3能够支持使用体验更为优秀的全网通3.0。与全网通2.0相同的是，其依然移动、联通、电信的2/3/4G网络，并且实现主卡盲插，但依然不能同时使用两张电信卡。值得注意的是，全网通3.0的特别之处在于副卡能够支持联通3G网络待机，这使得副卡的通话质量更高。'
            },
            3: {
                0: 'Q：小米5是否与小米Note同样搭载Hi-Fi芯片？其音质如何？',
                1: 'A：小米5并没有搭载任何的Hi-Fi芯片，在硬素质上自然没有多少优势。而在实际听感上，大概是目前智能手机的普遍水准，并没有太多值得描述的地方。'
            }
        }
    } else if (window.location.href === 'http://www.zaeke.com/article-3497-1.html') {
        data = {
            0: {
                0: 'Q：我应该选择哪一个版本好？',
                1: 'A：华为P9共计有三种版本，分别是运营商定制版、标配版与高配版，售价分别为2988、3188、3688，特点分别是价格最低、各方面平衡以及最为豪华。最为推荐的自然是高配版本，虽说售价最高，但不仅有着全网通的特性、更强的硬件配置，还有着文章中提及的独特工艺加持，而这一点反而更为关键。'
            },
            1: {
                0: 'Q：华为P9有什么缺点？',
                1: 'A：就目前的感受来说，华为P9的屏幕触控反应以及日常使用发热还需要好好调整，如此前的Mate 8相同，需要经过多个系统版本更新后才能够称得上完美。此外华为P9的屏幕色彩以及充电速度只能算是中规中矩，并且明明支持快速充电却标配5V/2A充电器，这更让人觉得不够上心。'
            },
            2: {
                0: 'Q：华为P9的指纹识别支持微信支付么？',
                1: 'A：目前并不支持微信支付，仅支持支付宝支付。'
            },
            3: {
                0: 'Q：华为P9的做工表现如何？',
                1: 'A：在我们手上使用的两台高配版华为P9，整体做工表现是相当优秀，大概相较Mate S稍显逊色些。主要问题在于后置摄像头部分的玻璃材质与机身结合的中规中矩，其中一台出现明显的高低差，而另外一台则相对优秀的多。'
            },
            4: {
                0: 'Q：徕卡（LEICA）在华为P9上的作用？',
                1: 'A：目前能够说的清的，分别是位于后置摄像头的标志、宣称徕卡参与设计与品质监控的后置摄像头镜头、拍摄功能中的徕卡水印、色彩模式以及快门声。说不清亦或者不能量化的，是其在拍摄成像的参与调校。'
            }
        }
    } else if (window.location.href === 'http://www.zaeke.com/article-3820-1.html') {
        data = {
            0: {
                0: 'Q：魅族PRO 6有NFC功能么？能和PRO 5一样做深圳通公交卡么？',
                1: 'A：这一次并不支持NFC功能。'
            },
            1: {
                0: 'Q：魅族PRO 6的指纹能做到什么功能？',
                1: 'A：能够支持支付宝支付以及魅族自家的mPay，也就是针对自家的应用，暂不支持微信支付。至于文档加密、应用加密等就没啥特别好说的了。'
            },
            2: {
                0: 'Q：魅族PRO 6的做工表现如何？容易掉漆么？',
                1: 'A：这里顺便一提，相比起魅族PRO 5的包装很好的卡紧机器，这一回的魅族PRO 6实在是不行。开箱时就不幸从70cm高处摔落，倒是砸了个坑而已，没有出现刮擦导致的掉漆。在使用一个月的时间，也仅SIM卡卡槽出现零星且微小的掉漆。'
            },
            3: {
                0: 'Q：魅族PRO 6的发热情况如何？充电时候的发热如何？',
                1: 'A：发热情况中规中矩，静如处子动如脱兔。充电时的发热导致控制的还好，只是依然不适合充电时同时使用。'
            },
            4: {
                0: 'Q：哪个颜色最好看？',
                1: 'A：这是个相当见仁见智的问题，我推荐黑色。即便说魅族后续推出了烈焰红与玫瑰金，但这一回的星空黑实际效果或者说长期看下去更为适合的多。'
            }
        }
    } else {
        $qa.remove()
        return
    }

    for (var i = 0; i < getDateLength(data); i++) {
        var $item = $('<div data-type="qaitem"></div>')
        var $q = $('<div data-type="question"></div>').text(data[i][0]).css({
            'font-weight': 'bold'
        })
        var $a = $('<div data-type="answer"></div>').text(data[i][1]).css({
            'margin-top': '10px'
        })

        $item.append($q, $a).css({
            padding: '10px 0',
            'border-bottom': '1px dotted gray'
        })
        $list.append($item)
    }
}(jQuery))